console.log(123);
var pms = {
  "妙蛙種子": [
    420,
    387
  ],
  "妙蛙草": [
    665,
    623
  ],
  "妙蛙花": [
    1100,
    1047
  ],
  "小火龍": [
    356,
    325
  ],
  "火恐龍": [
    636,
    595
  ],
  "噴火龍": [
    1151,
    1095
  ],
  "傑尼龜": [
    346,
    316
  ],
  "卡咪龜": [
    567,
    529
  ],
  "水箭龜": [
    982,
    931
  ],
  "綠毛蟲": [
    168,
    147
  ],
  "鐵甲蛹": [
    179,
    157
  ],
  "巴大蝶": [
    729,
    685
  ],
  "獨角蟲": [
    170,
    149
  ],
  "鐵殼蛹": [
    168,
    146
  ],
  "大針蜂": [
    761,
    717
  ],
  "波波": [
    248,
    223
  ],
  "比比鳥": [
    465,
    430
  ],
  "大比鳥": [
    854,
    807
  ],
  "小拉達": [
    252,
    226
  ],
  "拉達": [
    664,
    622
  ],
  "烈雀": [
    288,
    261
  ],
  "大嘴雀": [
    777,
    732
  ],
  "阿柏蛇": [
    333,
    304
  ],
  "阿柏怪": [
    744,
    700
  ],
  "皮卡丘": [
    337,
    307
  ],
  "雷丘": [
    867,
    819
  ],
  "穿山鼠": [
    512,
    475
  ],
  "穿山王": [
    997,
    946
  ],
  "尼多蘭": [
    315,
    287
  ],
  "尼多娜": [
    522,
    485
  ],
  "尼多后": [
    1002,
    951
  ],
  "尼多朗": [
    316,
    288
  ],
  "尼多力諾": [
    536,
    499
  ],
  "尼多王": [
    1022,
    970
  ],
  "皮皮": [
    465,
    430
  ],
  "皮可西": [
    1008,
    957
  ],
  "六尾": [
    331,
    302
  ],
  "九尾": [
    924,
    875
  ],
  "胖丁": [
    305,
    274
  ],
  "胖可丁": [
    817,
    768
  ],
  "超音蝠": [
    243,
    219
  ],
  "大嘴蝠": [
    784,
    739
  ],
  "走路草": [
    458,
    423
  ],
  "臭臭花": [
    648,
    607
  ],
  "霸王花": [
    1014,
    963
  ],
  "派拉斯": [
    358,
    327
  ],
  "派拉斯特": [
    710,
    667
  ],
  "毛球": [
    386,
    355
  ],
  "摩魯蛾": [
    830,
    783
  ],
  "地鼠": [
    199,
    172
  ],
  "三地鼠": [
    571,
    531
  ],
  "喵喵": [
    273,
    247
  ],
  "貓老大": [
    660,
    618
  ],
  "可達鴨": [
    414,
    381
  ],
  "哥達鴨": [
    973,
    922
  ],
  "猴怪": [
    429,
    395
  ],
  "火爆猴": [
    902,
    852
  ],
  "卡蒂狗": [
    476,
    440
  ],
  "風速狗": [
    1217,
    1160
  ],
  "蚊香蝌蚪": [
    298,
    270
  ],
  "蚊香君": [
    562,
    524
  ],
  "蚊香泳士": [
    1046,
    994
  ],
  "凱西": [
    492,
    451
  ],
  "勇基拉": [
    797,
    747
  ],
  "胡地": [
    1237,
    1176
  ],
  "腕力": [
    514,
    477
  ],
  "豪力": [
    818,
    772
  ],
  "怪力": [
    1238,
    1180
  ],
  "喇叭芽": [
    392,
    359
  ],
  "口呆花": [
    632,
    590
  ],
  "大食花": [
    972,
    921
  ],
  "瑪瑙水母": [
    410,
    376
  ],
  "毒刺水母": [
    1017,
    965
  ],
  "小拳石": [
    511,
    474
  ],
  "隆隆石": [
    778,
    732
  ],
  "隆隆岩": [
    1250,
    1192
  ],
  "小火馬": [
    643,
    602
  ],
  "烈焰馬": [
    965,
    914
  ],
  "呆呆獸": [
    516,
    479
  ],
  "呆殼獸": [
    1063,
    1011
  ],
  "小磁怪": [
    464,
    426
  ],
  "三合一磁怪": [
    958,
    906
  ],
  "大蔥鴨": [
    468,
    433
  ],
  "嘟嘟": [
    433,
    398
  ],
  "嘟嘟利": [
    916,
    866
  ],
  "小海獅": [
    385,
    353
  ],
  "白海獅": [
    812,
    765
  ],
  "臭泥": [
    544,
    506
  ],
  "臭臭泥": [
    1161,
    1106
  ],
  "大舌貝": [
    410,
    376
  ],
  "刺甲貝": [
    1060,
    1004
  ],
  "鬼斯": [
    429,
    392
  ],
  "鬼斯通": [
    735,
    688
  ],
  "耿鬼": [
    1122,
    1065
  ],
  "大岩蛇": [
    429,
    392
  ],
  "催眠貘": [
    425,
    391
  ],
  "引夢貘人": [
    877,
    829
  ],
  "大鉗蟹": [
    594,
    551
  ],
  "巨鉗蟹": [
    1154,
    1097
  ],
  "霹靂電球": [
    367,
    336
  ],
  "頑皮雷彈": [
    814,
    767
  ],
  "蛋蛋": [
    472,
    437
  ],
  "椰蛋樹": [
    1250,
    1192
  ],
  "卡拉卡拉": [
    404,
    371
  ],
  "嘎啦嘎啦": [
    725,
    681
  ],
  "飛腿郎": [
    1031,
    976
  ],
  "快拳郎": [
    899,
    849
  ],
  "大舌頭": [
    566,
    527
  ],
  "瓦斯彈": [
    467,
    432
  ],
  "雙彈瓦斯": [
    935,
    885
  ],
  "獨角犀牛": [
    719,
    676
  ],
  "鑽角犀獸": [
    1414,
    1353
  ],
  "吉利蛋": [
    629,
    577
  ],
  "蔓藤怪": [
    946,
    896
  ],
  "袋獸": [
    1055,
    1003
  ],
  "墨海馬": [
    395,
    361
  ],
  "海刺龍": [
    848,
    800
  ],
  "角金魚": [
    431,
    398
  ],
  "金魚王": [
    874,
    826
  ],
  "海星星": [
    397,
    363
  ],
  "寶石海星": [
    987,
    935
  ],
  "魔牆人偶": [
    850,
    799
  ],
  "飛天螳螂": [
    1056,
    1002
  ],
  "迷唇姐": [
    1076,
    1022
  ],
  "電擊獸": [
    941,
    891
  ],
  "鴨嘴火獸": [
    966,
    915
  ],
  "凱羅斯": [
    1187,
    1130
  ],
  "肯泰羅": [
    1066,
    1013
  ],
  "鯉魚王": [
    94,
    78
  ],
  "暴鯉龍": [
    1406,
    1345
  ],
  "拉普拉斯": [
    1115,
    1061
  ],
  "百變怪": [
    307,
    279
  ],
  "伊布": [
    415,
    382
  ],
  "水伊布": [
    1353,
    1293
  ],
  "雷伊布": [
    1170,
    1113
  ],
  "火伊布": [
    1245,
    1186
  ],
  "多邊獸": [
    672,
    630
  ],
  "菊石獸": [
    576,
    535
  ],
  "多刺菊石獸": [
    1150,
    1095
  ],
  "化石盔": [
    502,
    464
  ],
  "鐮刀盔": [
    1079,
    1024
  ],
  "化石翼龍": [
    1118,
    1063
  ],
  "卡比獸": [
    1438,
    1375
  ],
  "急凍鳥": [
    1257,
    1199
  ],
  "閃電鳥": [
    1427,
    1365
  ],
  "火焰鳥": [
    1402,
    1341
  ],
  "迷你龍": [
    368,
    337
  ],
  "哈克龍": [
    689,
    647
  ],
  "快龍": [
    1535,
    1470
  ],
  "超夢": [
    1706,
    1638
  ],
  "夢幻": [
    1324,
    1265
  ],
  "菊草葉": [
    343,
    313
  ],
  "月桂葉": [
    555,
    517
  ],
  "大竺葵": [
    954,
    904
  ],
  "火球鼠": [
    356,
    325
  ],
  "火岩鼠": [
    636,
    595
  ],
  "火爆獸": [
    1151,
    1095
  ],
  "小鋸鱷": [
    433,
    400
  ],
  "藍鱷": [
    685,
    643
  ],
  "大力鱷": [
    1166,
    1110
  ],
  "尾立": [
    222,
    198
  ],
  "大尾立": [
    714,
    671
  ],
  "咕咕": [
    274,
    247
  ],
  "貓頭夜鷹": [
    874,
    826
  ],
  "芭瓢蟲": [
    284,
    256
  ],
  "安瓢蟲": [
    546,
    507
  ],
  "圓絲蛛": [
    293,
    266
  ],
  "阿利多斯": [
    701,
    658
  ],
  "叉字蝠": [
    1057,
    1004
  ],
  "燈籠魚": [
    457,
    423
  ],
  "電燈怪": [
    890,
    841
  ],
  "皮丘": [
    161,
    140
  ],
  "皮寶寶": [
    266,
    239
  ],
  "寶寶丁": [
    219,
    193
  ],
  "波克比": [
    231,
    206
  ],
  "波克基古": [
    661,
    619
  ],
  "天然雀": [
    396,
    363
  ],
  "天然鳥": [
    846,
    799
  ],
  "咩利羊": [
    380,
    348
  ],
  "茸茸羊": [
    600,
    561
  ],
  "電龍": [
    1155,
    1100
  ],
  "美麗花": [
    903,
    855
  ],
  "瑪力露": [
    180,
    156
  ],
  "瑪力露麗": [
    644,
    602
  ],
  "樹才怪": [
    885,
    836
  ],
  "蚊香蛙皇": [
    1016,
    964
  ],
  "毽子草": [
    217,
    194
  ],
  "毽子花": [
    378,
    346
  ],
  "毽子棉": [
    665,
    623
  ],
  "長尾怪手": [
    509,
    472
  ],
  "向日種子": [
    135,
    117
  ],
  "向日花怪": [
    878,
    829
  ],
  "蜻蜻蜓": [
    568,
    529
  ],
  "烏波": [
    255,
    229
  ],
  "沼王": [
    827,
    780
  ],
  "太陽伊布": [
    1286,
    1226
  ],
  "月亮伊布": [
    879,
    830
  ],
  "黑暗鴉": [
    596,
    556
  ],
  "呆呆王": [
    1063,
    1011
  ],
  "夢妖": [
    763,
    718
  ],
  "未知圖騰": [
    438,
    404
  ],
  "果然翁": [
    438,
    398
  ],
  "麒麟奇": [
    798,
    752
  ],
  "榛果球": [
    448,
    413
  ],
  "佛烈托斯": [
    970,
    919
  ],
  "土龍弟弟": [
    692,
    649
  ],
  "天蠍": [
    753,
    708
  ],
  "大鋼蛇": [
    1045,
    990
  ],
  "布魯": [
    482,
    446
  ],
  "布魯皇": [
    1046,
    993
  ],
  "千針魚": [
    818,
    772
  ],
  "巨鉗螳螂": [
    1200,
    1143
  ],
  "壺壺": [
    128,
    102
  ],
  "赫拉克羅斯": [
    1259,
    1201
  ],
  "狃拉": [
    800,
    754
  ],
  "熊寶寶": [
    507,
    470
  ],
  "圈圈熊": [
    1183,
    1126
  ],
  "熔岩蟲": [
    321,
    292
  ],
  "熔岩蝸牛": [
    661,
    619
  ],
  "小山豬": [
    284,
    257
  ],
  "長毛豬": [
    979,
    928
  ],
  "太陽珊瑚": [
    520,
    483
  ],
  "鐵炮魚": [
    321,
    291
  ],
  "章魚桶": [
    910,
    861
  ],
  "信使鳥": [
    401,
    369
  ],
  "巨翅飛魚": [
    871,
    822
  ],
  "盔甲鳥": [
    871,
    822
  ],
  "戴魯比": [
    476,
    440
  ],
  "黑魯加": [
    1084,
    1030
  ],
  "刺龍王": [
    1038,
    986
  ],
  "小小象": [
    503,
    466
  ],
  "頓甲": [
    1295,
    1237
  ],
  "多邊獸Ⅱ": [
    1091,
    1037
  ],
  "驚角鹿": [
    852,
    804
  ],
  "圖圖犬": [
    167,
    145
  ],
  "無畏小子": [
    173,
    152
  ],
  "戰舞郎": [
    816,
    768
  ],
  "迷唇娃": [
    527,
    489
  ],
  "電擊怪": [
    460,
    425
  ],
  "鴨嘴寶寶": [
    505,
    468
  ],
  "大奶罐": [
    991,
    939
  ],
  "幸福蛋": [
    1379,
    1311
  ],
  "雷公": [
    1435,
    1373
  ],
  "炎帝": [
    1447,
    1385
  ],
  "水君": [
    1210,
    1153
  ],
  "幼基拉斯": [
    387,
    356
  ],
  "沙基拉斯": [
    689,
    646
  ],
  "班基拉斯": [
    1573,
    1508
  ],
  "洛奇亞": [
    1542,
    1477
  ],
  "鳳王": [
    1667,
    1600
  ],
  "時拉比": [
    1324,
    1265
  ],
  "木守宮": [
    395,
    363
  ],
  "森林蜥蜴": [
    646,
    604
  ],
  "蜥蜴王": [
    1107,
    1052
  ],
  "火稚雞": [
    411,
    378
  ],
  "力壯雞": [
    631,
    590
  ],
  "火焰雞": [
    1127,
    1072
  ],
  "水躍魚": [
    420,
    387
  ],
  "沼躍魚": [
    693,
    650
  ],
  "巨沼怪": [
    1206,
    1150
  ],
  "土狼犬": [
    241,
    216
  ],
  "大狼犬": [
    764,
    719
  ],
  "蛇紋熊": [
    181,
    160
  ],
  "直衝熊": [
    657,
    615
  ],
  "刺尾蟲": [
    215,
    191
  ],
  "甲殼繭": [
    221,
    197
  ],
  "狩獵鳳蝶": [
    674,
    631
  ],
  "盾甲繭": [
    221,
    197
  ],
  "毒粉蛾": [
    480,
    444
  ],
  "蓮葉童子": [
    225,
    201
  ],
  "蓮帽小童": [
    472,
    437
  ],
  "樂天河童": [
    955,
    905
  ],
  "橡實果": [
    225,
    201
  ],
  "長鼻葉": [
    478,
    442
  ],
  "狡猾天狗": [
    937,
    886
  ],
  "傲骨燕": [
    275,
    248
  ],
  "大王燕": [
    749,
    704
  ],
  "長翅鷗": [
    275,
    248
  ],
  "大嘴鷗": [
    844,
    796
  ],
  "拉魯拉絲": [
    187,
    165
  ],
  "奇魯莉安": [
    361,
    330
  ],
  "沙奈朵": [
    1270,
    1211
  ],
  "溜溜糖球": [
    298,
    270
  ],
  "雨翅蛾": [
    915,
    866
  ],
  "蘑蘑菇": [
    309,
    280
  ],
  "斗笠菇": [
    1032,
    978
  ],
  "懶人獺": [
    403,
    371
  ],
  "過動猿": [
    812,
    766
  ],
  "請假王": [
    1949,
    1876
  ],
  "土居忍士": [
    289,
    261
  ],
  "鐵面忍者": [
    750,
    705
  ],
  "脫殼忍者": [
    180,
    143
  ],
  "咕妞妞": [
    258,
    231
  ],
  "吼爆彈": [
    528,
    490
  ],
  "爆音怪": [
    971,
    920
  ],
  "幕下力士": [
    319,
    289
  ],
  "鐵掌力士": [
    1185,
    1126
  ],
  "露力麗": [
    135,
    116
  ],
  "朝北鼻": [
    356,
    323
  ],
  "向尾喵": [
    282,
    255
  ],
  "優雅貓": [
    593,
    554
  ],
  "勾魂眼": [
    559,
    520
  ],
  "大嘴娃": [
    636,
    595
  ],
  "可可多拉": [
    528,
    490
  ],
  "可多拉": [
    859,
    810
  ],
  "波士可多拉": [
    1287,
    1227
  ],
  "瑪沙那": [
    238,
    213
  ],
  "恰雷姆": [
    546,
    508
  ],
  "落雷獸": [
    347,
    316
  ],
  "雷電獸": [
    913,
    863
  ],
  "正電拍拍": [
    720,
    676
  ],
  "負電拍拍": [
    679,
    637
  ],
  "電螢蟲": [
    694,
    651
  ],
  "甜甜螢": [
    694,
    651
  ],
  "毒薔薇": [
    736,
    691
  ],
  "溶食獸": [
    338,
    308
  ],
  "吞食獸": [
    802,
    756
  ],
  "利牙魚": [
    374,
    339
  ],
  "巨牙鯊": [
    851,
    799
  ],
  "吼吼鯨": [
    610,
    567
  ],
  "吼鯨王": [
    967,
    912
  ],
  "呆火駝": [
    410,
    377
  ],
  "噴火駝": [
    864,
    816
  ],
  "煤炭龜": [
    873,
    824
  ],
  "跳跳豬": [
    550,
    512
  ],
  "噗噗豬": [
    990,
    939
  ],
  "晃晃斑": [
    466,
    431
  ],
  "大顎蟻": [
    468,
    431
  ],
  "超音波幼蟲": [
    456,
    422
  ],
  "沙漠蜻蜓": [
    1053,
    1001
  ],
  "刺球仙人掌": [
    463,
    427
  ],
  "夢歌仙人掌": [
    896,
    846
  ],
  "青綿鳥": [
    309,
    281
  ],
  "七夕青鳥": [
    801,
    754
  ],
  "貓鼬斬": [
    949,
    897
  ],
  "飯匙蛇": [
    826,
    779
  ],
  "月石": [
    962,
    912
  ],
  "太陽岩": [
    962,
    912
  ],
  "泥泥鰍": [
    306,
    278
  ],
  "鯰魚王": [
    853,
    805
  ],
  "龍蝦小兵": [
    474,
    439
  ],
  "鐵螯龍蝦": [
    993,
    941
  ],
  "天秤偶": [
    290,
    262
  ],
  "念力土偶": [
    763,
    718
  ],
  "觸手百合": [
    506,
    469
  ],
  "搖籃百合": [
    892,
    843
  ],
  "太古羽蟲": [
    561,
    522
  ],
  "太古盔甲": [
    1146,
    1091
  ],
  "醜醜魚": [
    94,
    78
  ],
  "美納斯": [
    1271,
    1213
  ],
  "飄浮泡泡": [
    636,
    596
  ],
  "變隱龍": [
    824,
    777
  ],
  "怨影娃娃": [
    374,
    341
  ],
  "詛咒娃娃": [
    888,
    839
  ],
  "夜巡靈": [
    224,
    198
  ],
  "彷徨夜靈": [
    572,
    531
  ],
  "熱帶龍": [
    791,
    745
  ],
  "風鈴鈴": [
    898,
    849
  ],
  "阿勃梭魯": [
    977,
    924
  ],
  "小果然": [
    215,
    189
  ],
  "雪童子": [
    331,
    302
  ],
  "冰鬼護": [
    833,
    787
  ],
  "海豹球": [
    375,
    344
  ],
  "海魔獅": [
    688,
    646
  ],
  "帝牙海獅": [
    1117,
    1063
  ],
  "珍珠貝": [
    467,
    431
  ],
  "獵斑魚": [
    917,
    866
  ],
  "櫻花魚": [
    977,
    925
  ],
  "古空棘魚": [
    1096,
    1042
  ],
  "愛心魚": [
    315,
    286
  ],
  "寶貝龍": [
    451,
    416
  ],
  "甲殼龍": [
    839,
    792
  ],
  "暴飛龍": [
    1514,
    1449
  ],
  "鐵啞鈴": [
    361,
    330
  ],
  "金屬怪": [
    673,
    630
  ],
  "巨金怪": [
    1559,
    1493
  ],
  "雷吉洛克": [
    1323,
    1262
  ],
  "雷吉艾斯": [
    1323,
    1262
  ],
  "雷吉斯奇魯": [
    969,
    917
  ],
  "拉帝亞斯": [
    1447,
    1385
  ],
  "拉帝歐斯": [
    1562,
    1496
  ],
  "蓋歐卡": [
    1746,
    1677
  ],
  "固拉多": [
    1746,
    1677
  ],
  "烈空坐": [
    1562,
    1497
  ],
  "基拉祈": [
    1324,
    1265
  ],
  "代歐奇希斯": [
    1178,
    1114
  ]
};

var data = `對戰|參加1次道館戰|5蕉香果/5傷藥/400星塵/指定PM遭遇(猴怪/戴魯比/小火龍/蚊香蝌蚪/妙蛙種子)xxx對戰|參加5次道館戰|1000星塵/10蕉香果/5傷藥/3好傷藥/4復活塊/指定PM遭遇(腕力/妙蛙種子)xxx對戰|贏得3次道館戰|3厲害傷藥/1全滿藥/1神奇糖果/指定PM遭遇(迷唇姐)xxx對戰|參加1次團體戰|5傷藥/5蕉香果/400星塵xxx對戰|贏得1次團體戰|10蕉香果/3好傷藥/4活力碎片/1000星塵xxx對戰|贏得2次團體戰|指定PM遭遇(火岩鼠)xxx對戰|贏得3次團體戰|1特殊招式學習器/3000星塵xxx對戰|贏得5次團體戰|指定PM遭遇(火爆獸)xxx對戰|贏得1次3星以上團體戰|2厲害傷藥/1神奇糖果xxx對戰|在1場道館戰使用屬性加成技|4活力碎片/3好傷藥/10蕉香果/1000星塵xxx對戰|在7場道館戰使用屬性加成技|1000星塵/6活力碎片/1活力塊/1神奇糖果/指定PM遭遇(電擊獸)xxx捕捉|捕獲10隻PM|指定PM遭遇(鯉魚王/霹靂電球/蛋蛋)200星塵/5紅球/3蔓莓果/1凰梨果xxx捕捉|捕獲5隻天氣加成PM|指定PM遭遇(六尾/蚊香蝌蚪/伊布)/200星塵/1凰梨果/5紅球xxx捕捉|捕獲10隻天氣加成PM|1000星塵xxx捕捉|捕獲20隻天氣加成PM|指定PM遭遇(九尾)xxx捕捉|捕獲1隻龍系PM|10黑球/2金莓果/1神奇糖果/3000星塵/指定PM遭遇(迷你龍)xxx捕捉|捕獲3隻蟲系PM|5紅球/3蔓莓果/1凰梨果/400星塵/指定PM遭遇(凱羅斯)xxx捕捉|捕獲3隻惡系PM|2凰梨果/5藍球/6蔓莓果/1000星塵/指定PM遭遇(戴魯比)xxx捕捉|捕獲3隻龍系PM|神奇糖果3個xxx捕捉|捕獲3隻電系PM|指定PM遭遇(皮卡丘)xxx捕捉|捕獲3隻火系PM|指定PM遭遇(熔岩蝸牛)xxx捕捉|捕獲3隻飛系PM|指定PM遭遇(嘟嘟)/1凰梨果xxx捕捉|捕獲3隻毒系PM|指定PM遭遇(臭泥/鬼斯/妙蛙種子)/200星塵/5紅球/3蔓莓果xxx捕捉|捕獲5隻火系PM|指定PM遭遇(火伊布)xxx捕捉|捕獲3隻草/火/地系PM|指定PM遭遇(呆火駝)xxx捕捉|捕獲1隻百變怪|3神奇糖果/10黑球/3000星塵xxx捕捉|捕獲3隻喵喵/向尾喵|指定PM遭遇(卡蒂狗)xxx捕捉|捕獲3隻木守宮/水躍魚|指定PM遭遇(火稚雞)xxx捕捉|捕獲3隻波波/黑暗鴉|指定PM遭遇(阿柏蛇)/1凰梨果/400星塵/3蔓莓果/5紅球xxx捕捉|捕獲3隻走路草/喇叭芽|指定PM遭遇(蔓藤怪)/2凰梨果/4~6蔓莓果/5藍球/1000星塵xxx捕捉|捕獲3隻青棉鳥|400星塵/3蔓莓果/5紅球/1凰梨果xxx捕捉|捕捉時使用5次莓果|6蔓莓果xxx養成|進化1隻PM|指定PM遭遇(伊布)xxx養成|進化5隻火屬性PM|指定PM遭遇(火伊布)xxx養成|孵化1顆蛋|400星塵/3蔓莓果/5紅球/指定PM遭遇(蛋蛋)xxx養成|孵化3顆蛋|3凰梨果/9蔓莓果/10紅球/指定PM遭遇(鴨嘴火獸)/2000經驗xxx養成|孵化5顆蛋|指定PM遭遇(吉利蛋)xxx養成|進行5次PM強化|指定PM遭遇(妙蛙種子/小火龍/傑尼龜)xxx擲球|擲出3顆Nice球|指定PM遭遇(霹靂電球)xxx擲球|擲出5顆Nice球|5紅球/3蔓莓果/400星塵/指定PM遭遇(霹靂電球)xxx擲球|連續擲出2顆Nice球|3蕉香果xxx擲球|連續擲出3顆Nice球|2黑球/5藍球/500星塵xxx擲球|連續擲出2顆Nice曲球|3蔓莓果/1凰梨果xxx擲球|擲出3顆Great球|400星塵/1凰梨果/5紅球/指定PM遭遇(鬼斯)xxx擲球|擲出5顆Great球|5蔓莓果xxx擲球|擲出3顆Great曲球|1神奇糖果xxx擲球|連續擲出3顆Great球|5黑球/10黑球/1神奇糖果/指定PM遭遇(大岩蛇)/2000星塵xxx擲球|連續擲出3顆Great曲球|指定PM遭遇(火恐龍)/3000星塵/10黑球/2金莓果/3神奇糖果xxx擲球|擲出Excellent球|1000星塵/5藍球/2黑球/2凰梨果xxx擲球|擲出3顆Excellent球|指定PM遭遇(幼基拉斯)xxx擲球|連續擲出3顆Excellent球|指定PM遭遇(幼基拉斯)xxx擲球|連續擲出5顆曲球|1000星塵/2凰梨果/5黑球xxx其他|轉3個未曾轉過補給站牌|指定PM遭遇(小火馬)xxx`

  var insertCP = (pm) => {
    if (!pms[pm]) {
      return `!!!${pm}!!!`;
    }
    return `
      <span class="pm">
        ${pm}
        <sup>${pms[pm][1]}-${pms[pm][0]}</sup>
      </span>
    `;
  };
  var rewordsPMs = (match, p1, offset, string) => {
    return `<a>${p1.split('|').map(insertCP)}</a>`;
  };
  var splitPM = (match, p1) => {
    return match.replace(/\//g, '|');
  };
  var sortRewords = (a, b) => {
    return a[a.length - 1] > b[b.length - 1];
  };
  var pmPattern = /指定PM遭遇\(([^)]+?)\)/g;
  var typeCounter = {};
  var _data = data
    .split('xxx')
    .filter(Boolean)
    .map(row => {
      if (typeCounter[row[0]]) {
        typeCounter[row[0]] += 1;
      } else {
        typeCounter[row[0]] = 1;
      }
      row.counter = typeCounter[row[0]];

      row = row.split('|');
      row[2] = row[2]
        .replace(pmPattern, splitPM)
        .split('/')
        .sort(sortRewords)

      if (row[2][0].startsWith('指定')) {
        row[2][0] = row[2][0].replace(pmPattern, rewordsPMs);
      }
      row[2] = row[2].reverse();
      return row;
    })
